modules/dsb-notification-lightweight/src/main/resources/notify.template

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><b:Notify xmlns:b="http://docs.oasis-open.org/wsn/b-2" xmlns:add="http://www.w3.org/2005/08/addressing"><b:NotificationMessage>TOPIC<b:Message>BODY</b:Message></b:NotificationMessage></b:Notify></soapenv:Body></soapenv:Envelope>
